# 상하좌우 : 계획서가 주어졌을 때 여행가 A가 최종적으로 도착할 지점의 좌표를 출력하는 프로그램.

# 입력 조건
# 첫째 줄에 공간의 크기를 나타내는 N이 주어진다. (1<=N<=100)
# 둘째 줄에 여행가 A가 이동할 계획서 내용이 주어진다. (1<=이동 횟수<=100)

# 출력 조건
# 첫째 줄에 여행가 A가 최종적으로 도착할 지점의 좌표(X, Y)를 공백으로 구분하여 출력한다.

N = int(input())
A = list(input().split())
cnt = len(A)
X, Y = 1, 1 # 출발 좌표, 왼쪽 상단

for i in range(cnt):
    if A[i] == 'L' and Y > 1:
        Y -= 1
    if A[i] == 'R' and Y < N:
        Y += 1
    if A[i] == 'U' and X > 1:
        X -= 1
    if A[i] == 'D' and X < N:
        X += 1

print(X, Y)



