# 부품 찾기 : 부품 N개가 있다. 각 부품은 정수 형태의 고유한 번호가 있다. M개 종류의 부품을 요청할 때 이를 모두 확인해서 견적서를 작성해야한다.
# 이때 가게 안에 부품이 모두 있는지 확인하는 프로그램을 작성해보자.

# 입력 조건
# 첫째 줄에 정수 N이 주어진다. (1<=N<=1,000,000)
# 둘째 줄에는 공백으로 구분하여 N개의 정수가 주어진다. 이때 정수는 1보다 크고 1,000,000 이하이다.
# 셋째 줄에는 정수 M이 주어진다. (1<=N<=1,000,000)
# 넷째 줄에는 공백으로 구분하여 M개의 정수가 주어진다. 이떄 정수는 1보다 크고 1,000,000 이하이다.

# 출력 조건
# 첫째 줄에 공백으로 구분하여 각 부품이 존재하면 yes 없으면 no를 출력한다.

N = int(input())
A = list(map(int, input().split()))

M = int(input())
B = list(map(int, input().split()))

for i in range(M):
    for j in range(N):
        if B[i] == A[j]:
            print("yes", end=' ')
            i = True
    if not i:
        print("no", end=' ')
        i = False


